#include <iostream>
#include <cmath>
using namespace std;
/*1. Написать функцию, сравнивающую числа, вводимые с клавиатуры. Результат сравнения
вывести в виде a>b.*/
double a, b;

void funk()
{do {
	cin>>a;
	cin>>b;
	if (a>b)
		cout<<a<<">"<<b;
	if (a<b)
		cout<<a<<"<"<<b; 
	else cout<<a<<"="<<b;
}

while (getchar()!='s');}

int main()
{
setlocale(0,"");
	
cout<<"введите два числа для их сравнения,\nпри введении буквы s процесс завершится\n";

funk();

return 0;
}
-----------------------------------------------------------------------------------------------------------------

#include <iostream>
#include <cmath>
using namespace std;
/*2. Написать функцию вычисления сопротивления цепи, состоящей из двух резисторов,
которые соединены последовательно или параллельно. Функция должна проверять корректность
ввода – если тип соединения указан неверно – вывести сообщение: «тип соединения указан
неверно».*/
char a;
	double R, r1, r2;

	void funk1(){R=r1+r2;
		cout<<"общее сопротивление проводников="<<R;}
	void funk2(){R=r1*r2/(r1+r2);
		cout<<"общее сопротивление проводников="<<R;}
int main()
{
	setlocale(0,"");
	
cout<<"введите тип соединения 'последовательное(posl)или  параллельное(par)\n";
cin>>a;

if ((a=='posl') || (a=='par')){
	cout<<"введите сопротивления двух проводников:\n";
	cin>>r1;
	cin>>r2;
		if (a=='posl')
			funk1();
		if (a=='par')
			funk2();
}
else
	cout<<"соединение введено не верно";

return 0;
}
-------------------------------------------------------------------------------------------------------------------

#include <iostream>
#include <cmath>
using namespace std;
/*Задача 3. Написать программу пересчета температуры из градусов Фаренгейта и градусы Цельсия,
используя функцию.*/
double a, g, G;

void funk1()
{
G=(g-32)*5/9;
	cout<<"это же количество градусов по Цельсию = "<<G;
}

void funk2(){
G=(g*9/5)+32;
	cout<<"это же количество градусов по Фаренгейту = "<<G;
}
int main()
{
	setlocale(0,"");
	double a, g, G;
cout<<"если хотите перевести из Фаренгейта в Цельсии, то введите цифру 1,\n если хотите из Цельсия в Фаренгейты, то цифру 2\n";
cin>>a;

if (a==1){
	cout<<"введите количество градусов по Фаренгейту\n";
	cin>>g;
	funk1();
}

if (a==2){
	cout<<"введите количество градусов по Цельсию\n";
	cin>>g;
	funk2();
}

return 0;
}
-------------------------------------------------------------------------------------------------------------------

#include <iostream>
#include <cmath>
using namespace std;
/*4. Написать программу, использующую функцию для вывода таблиц факториалов.*/
int a,i,F=1;
void funk()
{for (i=1;i<=a;i++){
	F=F*i;
	cout<<i<<"!"<<"	"<<F<<"\n";}}

int main()
{
setlocale(0,"");
cout<<"введите, до какой цифры вы хотите таблицу факториалов:\n";
cin>>a;
funk();


return 0;
}
------------------------------------------------------------------------------------------------------------------

#include <iostream>
#include <cmath>
using namespace std;
/*5. Переписать программу перевода из двоичной в десятичную и из десятичной в двоичную
с использованием функций.*/
double a, n, sum=0, c;
int x, d, g;
void funk0(){
	cout<<"введите двоичноечисло:\n";
	cin>>x;
		c=x/pow(10,n+1);
}
void funk1(){
	for(;n>=0;n--)
		g=pow(10,n-1);
		d=x % g ;
		sum=sum+(g*pow(2,n-1));
}
void funk2(){


}


int main()
{
setlocale(0,"");

cout<<"если хотите перевести из 2 в 10, то введите цифру 1,\n если хотите из 10 в 2, то цифру 2\n";
cin>>a;
if (a==1){
	funk0();
	funk1();
	} 
if (a==2){
	funk2();
	} 
if ((a!=2)&&(a!=1)){
	cout<<"ошибка";}
cout<<sum;
return 0;
}
