#include <iostream>
#include <cmath>
using namespace std;
/*1 Написать функцию пересчета температуры из градусов Фаренгейта в градусы Цельсия(Со=5/9(Fo-32), 
задавшись диапазоном и шагом изменения температуры, и программу, использующую эту функцию,
которая выводит на экран таблицу соответствия температур в шкалах Фаренгейта и Цельсия.*/


double Co, Fo, n, i, a;


void funk1()
{
	Co=(Fo-32)*5/9;	
}	

int main(){
	setlocale(0,"");

	cout<<"Напишите 2 целых значения в Фаренгейтахс\n";

	cout<<"max:\n";
	cin>>a;
	cout<<"mix:\n";
	cin>>i;
	cout<<"|	"<<"Фар"<<"|	"<<"Цел|\n";
	for (n=i;n<=a;n++){
		Fo=n;
		funk1();
		cout<<"|	"<<Fo<<"|	"<<Co<<"|\n";
	}

return 0;
}
================================================
#include <iostream>
#include <cmath>
using namespace std;
/*#include <iostream>
#include <cmath>
using namespace std;
/* 2 Написать функцию пересчета цены нефти за
баррель в цену за тонну (1 нефтяной баррель марк
и Urals равен 136,4кг), задавшись ценой барреля,
и программу, которая ее использует.*/


double M, z, Z, t;


void funk1()
{
	t=M/136,4;
	Z=z*t;	
}	

int main(){
	setlocale(0,"");

	cout<<"Напишите цену за баррель\n";
	cin>>z;
	cout<<"Напишите массу нефти в кг\n";
	cin>>M;
	funk1();
	cout<<"В итоге цена за "<<M<<"кг нефти равна ="<<Z;
return 0;
}
===============================================
#include <iostream>
#include <cmath>
using namespace std;
/*3 Написать функцию, которая вычисляет объем цилиндра,
запрашивая высоту и радиус, и программу, которая ее использует.*/


double h, r, V, Pi=3.14;


void funk1()
{
	V=h*Pi*pow(r,2);	
}	

int main(){
	setlocale(0,"");

	cout<<"Для вычисления объёма цилиндра введите:\n";

	cout<<"высоту:\n";
	cin>>h;
	cout<<"радиус:\n";
	cin>>r;
	funk1();
	cout<<"объём цилиндра равен = "<<V;

return 0;
}
===============================================

#include <iostream>
#include <cmath>
using namespace std;
/*4 Написать программу, использующую функцию для вывода таблицы факториалов.*/


double i,n,r=1;


void funk1()
{
	for(int i=1;i<=n;i++){
	r*=i;
	cout<<"|"<<i<<"	|	"<<r<<"	|\n";
	}	
}	

int main(){
	setlocale(0,"");
	cout<<"До какого числа считать факториал? Напиши:\n";
	cin>>n;
	funk1();
return 0;
}
===============================================
#include <iostream>
#include <cmath>
using namespace std;
/*5 Написать функцию пересчета расстояния из миль 
в километры и программу, которая ее использует (1миля=1,60094км)*/


double m, k;


void funk1()
{
	k=m*1.60094;	
}	

int main(){
	setlocale(0,"");
	cout<<"Напиши количество миль:\n";
	cin>>m;
	funk1();
	cout<<"Из	"<<m<<"	миль получим	"<<k<<"	километров";
return 0;
}
================================================
#include <iostream>
#include <cmath>
using namespace std;
/*6 Написать функцию пересчета длины из дюймов в мм в и программу, которая ее использует*/


double m, d;


void funk1()
{
	d=m*0.03937;	
}	

int main(){
	setlocale(0,"");
	cout<<"Напиши количество милиметров:\n";
	cin>>m;
	funk1();
	cout<<"Из	"<<m<<"	милиметров получим	"<<d<<"	дюймов";
return 0;
}
================================================
#include <iostream>
#include <cmath>
using namespace std;
/*7 Написать функцию, которая вычисляет доход по вкладу.
Исходные данные – величина вклада, процентная ставка (годовых)
и срок вклада – количество дней.*/


double v, p, D, d;


void funk1()
{
	D=v*(p/100)*d/365;
}	

int main(){
	setlocale(0,"");
	cout<<"Напиши величину вклада:\n";
	cin>>v;
	cout<<"Напиши процентную ставку:\n";
	cin>>p;
	cout<<"Напиши количество дней:\n";
	cin>>d;
	funk1();
	cout<<"Доход по вкладу равен = "<<D;
return 0;
}
==============================================
#include <iostream>
using namespace std;
float num, percent, result;

/* 8 Написать функцию, возвращающую процент от числа, полученного в качестве аргумента.*/

double n, p, P;
void funk1()
{
	P=n*p/100;
}

int main()
{   setlocale(0,"");
	cout << "Введите аргумент" << endl;
	cin >> n;
	cout << "Введите процент от числа";
	cin >> p;
	funk1();
	cout << "Процент от числа : " << P;
	return 0;

}

