#include <iostream> 
#include <cmath> 
using namespace std;

/*1. Написать функцию, обеспечивающую решение квадратного
уравнения. Параметрами функции должны быть коэффициенты и корни
уравнения (float*x1, float*x2). Значением функции должна быть информация 
о корнях уравнения: 2 разных корня, 1 – корни одинаковые, 0 – уравнение 
не имеет решения. Кроме того, функция должна проверять корректность исходных данных.
Если исходные данные неверные, то функция должна возвращать -1.
То есть, в функции вычислить дискриминант и корни *x1=(-b+sqrt(D)/(2*a)) и x2.
Корни в main() объявить как float x1, x2.
*/

double a, b, c, x1, x2, D;

void correctnoct(){
	if ((a!=0) || (b!=0)){
		cout<<"Данные введены корректно\n";}
	else 
		cout<<"Данные введены не корректно\n";

}



void corni1(){
	x1=-b/(2*a);
	cout<<"Единственный корень равен = "<<x1;
}


void corni2(){
	x1=(-b+sqrt(D)/(2*a));
	x2=(-b-sqrt(D)/(2*a));
	cout<<"Первый корень = "<<x1;
	cout<<"Второй корень = "<<x2;
}

void disk(){
 D=pow(b,2)-4*a*c;
 cout<<"дискриминант равен = "<<D<<endl;
}

int main()
{
setlocale(0,"");

	cout<<"Уравнение выглядит как a*x^2+b*x+c=0\n введите параметры a, b и c\nвведите а:";
	cin>>a;
	cout<<"введите b\n";
	cin>>b;
	cout<<"введите c\n";
	cin>>c;

	correctnoct();
	disk();
	cout<<"дискриминант равен = "<<D<<endl;

	 if (D<0){
	 cout<<"Корней нет\n";
 } 

  if (D=0){
	 cout<<"Корень один\n";
	 corni1();
  }

   if (D>0){
	 cout<<"Два корня\n";
	 corni2();
   }
return 0;
}
=================================================
#include <iostream> 
#include <cmath> 
using namespace std;

/*#include <iostream> 
#include <cmath> 
using namespace std;

/* Есть три треугольных участка, которые надо огородить проволокой.
Стандартная бухта содержит 200 м проволоки.
Написать программу, которая вычисляет, достаточно или недостаточно проволоки 
для ограждения участков. Расчет периметров реализовать с помощью функции,
которая организует ввод  с клавиатуры сторон участков и параметра B /S (достаточно/недостаточно).
Передачу входных данных в функцию организовать по ссылке, а размер бухты –  по умолчанию.
*/

double a, b, c, o, p;

void perimetr(double &a, double &b, double &c){
	p=a+b+c;

}



int main(){
	setlocale(0,"");
	o=200;
	cout<<"Ведите длину сторон первого треугольного участка в метрах:";
	cin>>a>>b>>c;
	perimetr(a, b, c);
	o=o-p;
	cout<<"Ведите длину сторон второго треугольного участка в метрах:";
	cin>>a>>b>>c;
	perimetr(a, b, c);
	o=o-p;
	cout<<"Ведите длину сторон третьего треугольного участка в метрах:";
	cin>>a>>b>>c;
	perimetr(a, b, c);
	o=o-p;
	if (o>=0){
	cout<<"длины хватило, и осталось "<<o<<" метров верёвки";
	}
return 0;
}

